//создать функцию ЦенаНаДату для вызова из клиентского кода форм, которая вызовет одноименную функцию из модуля ЦеныСервер 
//"Промежуточная прокладка" для вызова модуля ЦеныСервер
//Подобное использовалось в ...

Функция  ЦенаНаДату(Номенклатура,Дата) Экспорт
	
	   ЦенаНаДату=ЦеныСервер.ЦенаНаДату(Номенклатура,Дата); 
	   Возврат ЦенаНаДату;  
	   
КонецФункции  

 //создать функцию СкидкаНаДату для вызова из клиентского кода форм, которая вызовет одноименную функцию из модуля ЦеныСервер 
//"Промежуточная прокладка" для вызова модуля ЦеныСервер
//Подобное использовалось в ...

Функция  СкидкаНаДату(НоменклатураНоменклатурнаяГруппа,Дата) Экспорт
	
	 СкидкаНаДату=ЦеныСервер.СкидкаНаДату(НоменклатураНоменклатурнаяГруппа,Дата); 
	 Возврат СкидкаНаДату; 
КонецФункции