
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;    
	
		
	Ответственный=ПараметрыСеанса.ТекущийСотрудник;
КонецПроцедуры   

//ИмяТекущегоПользователя=ПользователиИнформационнойБазы.ТекущийПользователь().ПолноеИмя;  
//	
//	ИмяТекущегоСотрудника=Справочники.Сотрудники.НайтиПоНаименованию(ИмяТекущегоПользователя);    
//	
//	ПараметрыСеанса.СотрудникТекущегоПользователя=ИмяТекущегоСотрудника;  
// ИмяТекущегоСотрудника=ПользователиИнформационнойБазы.ТекущийСотрудник().ПолноеИмя;  


