
&НаКлиенте
Процедура СлучайныйПароль(Команда)
   ГСЧ = Новый ГенераторСлучайныхЧисел();    
   ~ГенерацияНовогоПароля:
    Пароль = ""; 
	НетЦифр=Истина; 
	Пока СтрДлина(Пароль)<6 Цикл 
		НомерСимвола=ГСЧ.СлучайноеЧисло(КодСимвола("0"),КодСимвола("z"));
		Если НомерСимвола<58 ИЛИ (НомерСимвола>64 И НомерСимвола<91) или
			НомерСимвола>96 Тогда
			Пароль=Пароль+Символ(НомерСимвола);
		КонецЕсли;   
		Если НомерСимвола<58 Тогда
			НетЦифр=Ложь;
		КонецЕсли;
	 КонецЦикла;
	 Если НетЦифр Тогда
		 Перейти ~ГенерацияНовогоПароля;
	 КонецЕсли; 
	 
	Элементы.Пароль.РежимПароля = Ложь;
    Сообщить(Пароль); 
		
КонецПроцедуры  

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)      
	Если ЗначениеЗаполнено (ТекущийОбъект.ИдентификаторПользователяИБ) Тогда
		ПользовательИБ=ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекущийОбъект.ИдентификаторПользователяИБ); 
		ПользовательИБ.Имя = ИмяДляВхода;
        ПользовательИБ.Пароль = "";
        ПользовательИБ.АутентификацияСтандартная = ВходРазрешен;  
		ПользовательИБ.Записать();
	 ИначеЕсли Не ЗначениеЗаполнено(ТекущийОбъект.ИдентификаторПользователяИБ) И 
            ВходРазрешен = Истина Тогда  
			ПользовательИБ=ПользователиИнформационнойБазы.СоздатьПользователя();
			ПользовательИБ.Имя=ИмяДляВхода;
			ПользовательИБ.ПолноеИмя=Объект.Наименование; 
			ПользовательИБ.Пароль=""; 
			ПользовательИБ.АутентификацияСтандартная=ВходРазрешен; 
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.БазовыеПрава);
			ПользовательИБ.Записать();  
			ТекущийОбъект.ИдентификаторПользователяИБ  = ПользовательИБ.УникальныйИдентификатор; 
	КонецЕсли;   
		
КонецПроцедуры   

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект) 
	Если ЗначениеЗаполнено(ТекущийОбъект.ИдентификаторПользователяИБ) Тогда
    ПользовательИБ=ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекущийОбъект.ИдентификаторПользователяИБ);
    Пароль="";
    ИмяДляВхода=ПользовательИБ.Имя; 
	ВходРазрешен=ПользовательИБ.АутентификацияСтандартная;
		
	ИначеЕсли Не ЗначениеЗаполнено(ТекущийОбъект.ИдентификаторПользователяИБ)И ПользовательИб=Неопределено тогда
    ВходРазрешен=ложь;
    ИмяДляВхода=Неопределено;
	Пароль=Неопределено;
	КонецЕсли;
КонецПроцедуры

                                                                                                                           