
&НаКлиенте
Процедура ВывестиСообщение(Команда)
	Сообщить("ОченьВажноеСообщение");
КонецПроцедуры


&НаКлиенте
Процедура Вычисления(Команда)
	
	Вычисление = 2+2;
	Сообщить(Вычисление);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)      
	Если ЗначениеЗаполнено (ТекущийОбъект.ИдентификаторПользователяИБ) Тогда
		ПользовательИБ=ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекущийОбъект.ИдентификаторПользователяИБ); 
		ПользовательИБ.Имя = ИмяДляВхода;
        ПользовательИБ.Пароль = "";
        ПользовательИБ.АутентификацияСтандартная = ВходРазрешен;  
		ПользовательИБ.Записать();
	 ИначеЕсли Не ЗначениеЗаполнено(ТекущийОбъект.ИдентификаторПользователяИБ) И 
            ВходРазрешен = Истина Тогда  
			ПользовательИБ=ПользователиИнформационнойБазы.СоздатьПользователя();
			ПользовательИБ.Имя=ИмяДляВхода;
			ПользовательИБ.ПолноеИмя=Объект.Наименование; 
			ПользовательИБ.Пароль=""; 
			ПользовательИБ.АутентификацияСтандартная=ВходРазрешен; 
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.БазовыеПрава);
			ПользовательИБ.Записать();  
			ТекущийОбъект.ИдентификаторПользователяИБ  = ПользовательИБ.УникальныйИдентификатор; 
	КонецЕсли;   
		
КонецПроцедуры   

                                                                                                                          