
&НаКлиенте
Процедура ЗаполнитьРегистрКалендарь(Команда)
	ЗаполнитьРегистрКалендарьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРегистрКалендарьНаСервере()
	
	Курсор = Период.ДатаНачала; 
	Пока Курсор<=Период.ДатаОкончания Цикл
	
		Запись = РегистрыСведений.Календарь.СоздатьМенеджерЗаписи(); 
		Запись.Дата = Курсор;
		
		Если ДеньНедели (Курсор) <=5  Тогда
		
			Запись.РабочихДней = 1; 
		
		КонецЕсли;                  
		
		Запись.Записать(); 
		Курсор = Курсор + 86400; 
	
	КонецЦикла;
	
КонецПроцедуры
