

&НаКлиенте
Процедура ПриИзмененииСотрудника(ИзмененнаяСтрока)   
	
	Если ЗначениеЗаполнено(ИзмененнаяСтрока.Сотрудник) Тогда
	   Сотрудник = ИзмененнаяСтрока.Сотрудник; 
	   СуммаОклада = СотрудникиВызовСервера.СотрудникОклад(Сотрудник);
	   ИзмененнаяСтрока.СуммаОклада = СуммаОклада;   
	   ИзмененнаяСтрока.ДатаНачала = НачалоМесяца(Объект.Дата);
	   ИзмененнаяСтрока.ДатаОкончания = КонецМесяца(Объект.Дата);      
	   ИзмененнаяСтрока.КоличествоРабочихДней = ПодсчетыРабДнейСервер.ЧислоРабДней(ИзмененнаяСтрока.ДатаНачала, ИзмененнаяСтрока.ДатаОкончания); 
	   ИзмененнаяСтрока.СтавкаОдногоДня = СуммаОклада /  ИзмененнаяСтрока.КоличествоРабочихДней; 
    КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиСотрудникПриИзменении(Элемент)  
	ИзмененнаяСтрока=Элементы.Сотрудники.ТекущиеДанные;
	ПриИзмененииСотрудника(ИзмененнаяСтрока);
КонецПроцедуры

