
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)  
	
	Ответственный=ПараметрыСеанса.ТекущийСотрудник;
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// сохранять в реквизит шапки Сумма итог по одноименному реквизиту табличной части для отображения в списках
	// Посмотреть в Документах по ДЗ     
	Сумма = ТоварыИУслуги.Итог("СуммаСНДС");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)    
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	СУММА(ПоступлениеТоваровИУслугТоварыИУслуги.Количество) КАК Количество,
	                    |	СУММА(ПоступлениеТоваровИУслугТоварыИУслуги.Цена) КАК Цена,
	                    |	СУММА(ПоступлениеТоваровИУслугТоварыИУслуги.СуммаСНДС) КАК СуммаСНДС,
	                    |	ПоступлениеТоваровИУслугТоварыИУслуги.Номенклатура КАК Номенклатура,
	                    |	ПоступлениеТоваровИУслугТоварыИУслуги.Номенклатура.Тип КАК Тип
	                    |ИЗ
	                    |	Документ.ПоступлениеТоваровИУслуг.ТоварыИУслуги КАК ПоступлениеТоваровИУслугТоварыИУслуги
	                    |ГДЕ
	                    |	ПоступлениеТоваровИУслугТоварыИУслуги.Ссылка = &Ссылка
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	ПоступлениеТоваровИУслугТоварыИУслуги.Номенклатура,
	                    |	ПоступлениеТоваровИУслугТоварыИУслуги.Номенклатура.Тип"); 
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка); 
	Результат=Запрос.Выполнить().Выгрузить();     
	
	Движения.Товары.Записывать = Истина;
	Движения.Расходы.Записывать = Истина; 
	Движения.Управленческий.Очистить();  
	Движения.Управленческий.Записывать=Истина;
	
	Для Каждого Строка Из Результат Цикл    // регистр Товары Приход
		
		Если Строка.Тип=Перечисления.ТипыНоменклатуры.Товар Тогда
			Движение = Движения.Товары.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Номенклатура = Строка.Номенклатура;
			Движение.Количество = Строка.Количество;    
			Движение.Сумма = Строка.СуммаСНДС; 
			
			// регистр Управленческий     Дт41 Товары - Кт60 Рассчеты с поставщиками   
			Проводка=Движения.Управленческий.Добавить(); 
			Проводка.Период=Дата; 
			Проводка.СчетДт=ПланыСчетов.Управленческий.Товары;   
			Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура]
			=Строка.Номенклатура; 
			Проводка.СчетКт=ПланыСчетов.Управленческий.РассчетыСПоставщиками; 
			Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты]
			=Поставщик;
			Проводка.Сумма=Строка.СуммаСНДС;  
			Проводка.Количество = Строка.Количество; 
			
		ИначеЕсли Строка.Тип=Перечисления.ТипыНоменклатуры.Услуга Тогда  // регистр Расходы 
			Движение = Движения.Расходы.Добавить();
			Движение.Период = Дата;
			Движение.Номенклатура = Строка.Номенклатура;
			Движение.Сумма = Строка.СуммаСНДС;  
			
			Проводка=Движения.Управленческий.Добавить(); 
			Проводка.Период=Дата;  
			
			Проводка.СчетДт=ПланыСчетов.Управленческий.Расходы;   
			Проводка.СчетКт=ПланыСчетов.Управленческий.РассчетыСПоставщиками; 
			Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты]
			=Поставщик;
			Проводка.Сумма=Строка.СуммаСНДС;
			
		КонецЕсли; 
	КонецЦикла;     
	
	// регистр ВзаиморасчетыСКонтрагентами Расход
	Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
	Движение = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Контрагент = Поставщик;
	Движение.Сумма = Сумма;
	
КонецПроцедуры





