Функция ЧислоРабДней(ДатаНачала, ДатаОкончания)   Экспорт
	
	ЧислоРабДней = 0;     
	Времен = ДатаНачала; 
	
	Пока Времен <= ДатаОкончания Цикл
		
		Если ДеньНедели (Времен) <6  Тогда   //И не входит в МассивПраздников (доработать) 
			
			ЧислоРабДней = ЧислоРабДней + 1; 
			
		КонецЕсли;                  
		
		
		Времен=Времен + 86400;
	КонецЦикла;    
	
	Возврат ЧислоРабДней; 
	
	
КонецФункции // ()    

//Функция ФактическиОтработано ()

//	 Факт = РегистрыРасчета.Зарплата.ПолучитьДанныеГрафика(Отбор, 
//			ВидПериодаРегистраРасчета.ФактическийПериодДействия)[0].РабочихДней;


//КонецФункции // ()


